// Напишіть функцію, яка виводить на екран числа від 1 до 100. 
// При цьому замість чисел, кратних 3, програма повинна виводити слово "Foo", а замість чисел, кратних п'яти  - слово "Bar". 
// Якщо число кратне п'ятнадцяти, програма повинна виводити слово ‘FooBar’.

const fooBar = () => {

  for ( let i = 1; i <= 100; i+= 1){
    
    if (i % 15 === 0){ 
      console.log(i,"FooBar")

    } else if (i % 3 === 0){ 
      console.log(i,"Foo")

    } else if (i % 5 === 0){ 
      console.log(i,"Bar")

    } else {
      console.log(i)
    }
  }
}

fooBar()