// 5. Напишіть функцію, яка повертає promise.
// Через 10 мілісекунд promise executor повинен почати рахувати від 0 до 1000000000 використовуючи цикл, а потім стає resolved.
// Викличте цю функцію та виміряйте витрачений час використовуючи console.time та console.timeEnd.
// Викличте цю функцію чотири рази паралельно та виміряйте витрачений час.
// Викличте цю функцію чотири рази послідовно та виміряйте витрачений час.
// Напишіть у коментарі чи змінився витрачений час між послідовним та паралельним викликом функцій чи ні.